param_names = {
    'eta_k',       ...  % 压气机绝热效率
    'eta_t',       ...  % 涡轮绝热效率
    'eta_m',       ...  % 机械效率
    'eta_v',       ...  % 风扇效率
    'eta_tv',      ...  % 风扇涡轮效率
    'eta_c1',      ...  % 一次喷管效率
    'eta_c2',      ...  % 二次喷管效率
    'sigma_cc',    ...  % 进气道激波总压恢复系数
    'sigma_kan',   ...  % 进气通道总压恢复系数
    'sigma_kask',  ...  % 压气机级间总压恢复系数
    'sigma_ks',    ...  % 燃烧室总压恢复系数
    'eta_T',       ...  % 燃烧放热系数
    'lambda'        ...  % 风扇涡轮热恢复系数
};

lb = [0.84, 0.86, 0.980, 0.85, 0.90, 0.94, 0.92, 0.98, 0.98, 0.98, 0.94, 0.97, 1.02];
ub = [0.86, 0.92, 0.995, 0.87, 0.92, 0.95, 0.94, 1.00, 0.99, 0.99, 0.96, 0.99, 1.04];

theta_true = [
    0.85,    ...  % eta_k
    0.89,    ...  % eta_t
    0.988,   ...  % eta_m
    0.860,   ...  % eta_v
    0.910,   ...  % eta_tv
    0.945,   ...  % eta_c1
    0.930,   ...  % eta_c2
    0.990,   ...  % sigma_cc
    0.985,   ...  % sigma_kan
    0.985,   ...  % sigma_kask
    0.950,   ...  % sigma_ks
    0.980,   ...  % eta_T
    1.030    ...  % lambda
];

cond.T_H       = 288;
cond.M_flight  = 0.0;
cond.m         = 10.0;
cond.pi_k      = 33.0;
cond.T_g       = 1700.0;

N          = 500;
COV_target = 1.0;
n_steps    = 3;
scale      = 0.2;

disp('参数定义完成')
